Revit 2024 API
Frame.IsOrthogonal Method
 Determines if this frame's basis vectors are orthogonal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsOrthogonal()
Visual Basic
Public Function IsOrthogonal As Boolean
Visual C++
public:
bool IsOrthogonal()
Return Value
 True if this frame's basis vectors are orthogonal, false if not.
See Also
Frame Class
Autodesk.Revit.DB Namespace